Catalogs/Renault_НастройкиСписков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_НастройкиСписков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Renault_унсСервер/Ext/Module.bsl
Функция СохранятьАвтоматически( пНастрокаСсылка ) Экспорт
	Возврат пНастрокаСсылка.СохранятьАвтоматически;
КонецФункции

Функция СохранитьНастройку( пСтруктураНастройки, пНастройка ) Экспорт
	
	НастройкаСсылка = пСтруктураНастройки.Ссылка;
	//Если ТипЗнч(НастройкаСсылка) <> Тип("СправочникСсылка.унсНастройкиДинамическихСписков") И ЗначениеЗаполнено(НастройкаСсылка) Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкаСсылка) Тогда
		НастройкаОбъект = НастройкаСсылка.ПолучитьОбъект();
	Иначе
		НастройкаОбъект = Справочники.Renault_НастройкиСписков.СоздатьЭлемент();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НастройкаОбъект, пСтруктураНастройки);
	НастройкаОбъект.Пользователь = ПараметрыСеанса.Пользователь;
	НастройкаОбъект.Настройка = Новый ХранилищеЗначения(пНастройка);
	НастройкаОбъект.Записать();
	
	Возврат НастройкаОбъект.Ссылка;
	
	//НастройкиМенеджерЗаписи = РегистрыСведений.унсНастройкиДинамическихСписков.СоздатьМенеджерЗаписи();
	//НастройкиМенеджерЗаписи.КлючОбъекта 			= пКлючОбъекта;
	//НастройкиМенеджерЗаписи.КлючНастройки 			= пКлючНастройки;
	//НастройкиМенеджерЗаписи.Пользователь 			= ПараметрыСеанса.Пользователь;
	//НастройкиМенеджерЗаписи.ИспользоватьПриОткрытии	= пИспользоватьПриОткрытии;
	//НастройкиМенеджерЗаписи.СохранятьАвтоматически 	= пСохранятьАвтоматически;
	//НастройкиМенеджерЗаписи.Настройка 				= Новый ХранилищеЗначения(пНастройка);
	//НастройкиМенеджерЗаписи.Записать(Истина);
КонецФункции	//СохранитьНастройку

Функция ПолучитьНастройку( пНастройкаСсылка ) Экспорт
	
	Настройка = Неопределено;
	
	//Если ТипЗнч(пНастройкаСсылка) <> Тип("СправочникСсылка.унсНастройкиДинамическихСписков") И ЗначениеЗаполнено(пНастройкаСсылка) Тогда
	//	Возврат Настройка;
	//КонецЕсли;
	
	Возврат пНастройкаСсылка.Настройка.Получить();
		
КонецФункции	//ПолучитьНастройку

// возвращает таблицу настроек текущего пользователя для объекта пКлючОбъекта
Функция ПолучитьТаблицуНастроек( пКлючОбъекта ) Экспорт
	
	пПользователь = ПараметрыСеанса.Пользователь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлючОбъекта", пКлючОбъекта);
	Запрос.УстановитьПараметр("Пользователь",пПользователь);
	Запрос.Текст = "ВЫБРАТЬ
	               |	унсНастройкиДинамическихСписков.Ссылка,
	               |	унсНастройкиДинамическихСписков.Наименование,
	               |	унсНастройкиДинамическихСписков.КлючОбъекта,
	               |	унсНастройкиДинамическихСписков.Пользователь,
	               |	унсНастройкиДинамическихСписков.ИспользоватьПриОткрытии,
	               |	унсНастройкиДинамическихСписков.СохранятьАвтоматически
	               |ИЗ
	               |	Справочник.Renault_НастройкиСписков КАК унсНастройкиДинамическихСписков
	               |ГДЕ
	               |	унсНастройкиДинамическихСписков.КлючОбъекта = &КлючОбъекта
	               |	И унсНастройкиДинамическихСписков.Пользователь = &Пользователь
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Основная - настройка, используемая при открытии (признак ИспользоватьПриОткрытии)
// Возвращаемое значение - Ссылка на элемент справочника унсНастройкиДинамическихСписков
Функция ПолучитьОсновнуюНастройку( пКлючОбъекта ) Экспорт
	
	Рез = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлючОбъекта", пКлючОбъекта);
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	Запрос.Текст = "ВЫБРАТЬ
	               |	унсНастройкиДинамическихСписков.Ссылка
	               |ИЗ
	               |	Справочник.Renault_НастройкиСписков КАК унсНастройкиДинамическихСписков
	               |ГДЕ
	               |	унсНастройкиДинамическихСписков.КлючОбъекта = &КлючОбъекта
	               |	И унсНастройкиДинамическихСписков.Пользователь = &Пользователь
	               |	И унсНастройкиДинамическихСписков.ИспользоватьПриОткрытии";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Рез = Новый Структура( "Ссылка, ЗначениеНастройки", Выборка.Ссылка, Выборка.Ссылка.Настройка.Получить() );
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции	//ПолучитьНастройку
 
// Возвращает массив таблиц формы, источником данных для которых служит ДинамическийСписок
// Элемент массива - структура (Имя, ПутьКДанным)
// 		МассивИменЭУ. Тип: "массив" ( тип элемента - "Строка" ). 
// 			Элемент массив - имя элемента управления типа ТаблицаФормы, связанного с динамическим списком, настройками которого нужно управлять.
//       	Необязательный. Если не указан, то будут искаться все элементы управления формы типа ТаблицаФормы, которые связаны с дин. списками
Функция ПолучитьМассивТаблицФормы(пФорма, МассивИменЭУ = Неопределено)
	
	МассивТаблиц = Новый Массив;
	
	ТипТаблицаФормы = Тип("ТаблицаФормы");	
	ТипДинамическийСписок = Тип("ДинамическийСписок");
	
	Если МассивИменЭУ = Неопределено Тогда	// массив элементов, настройками которых будем управлять не задан
		// сформируем этот массив самостоятельно. Включим в него имена всех таблиц на форме с источником данных ДинамическийСписок
		Для каждого Элемент Из пФорма.Элементы Цикл
			Если ТипЗнч(Элемент) = ТипТаблицаФормы Тогда
				ИсточникДанных = пФорма[Элемент.ПутьКДанным];
				Если НЕ ИсточникДанных = Неопределено И ТипЗнч(ИсточникДанных) = ТипДинамическийСписок Тогда
					МассивТаблиц.Добавить( Новый Структура( "Имя, ПутьКДанным", Элемент.Имя, Элемент.ПутьКДанным) );
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(МассивИменЭУ) = Тип("Массив") Тогда
		Для каждого ИмяЭУ Из МассивИменЭУ Цикл
			ИмяРеквизита = пФорма.Элементы[ИмяЭУ].ПутьКДанным;
			ИсточникДанных = пФорма[ИмяРеквизита];
			Если НЕ ИсточникДанных = Неопределено И ТипЗнч(ИсточникДанных) = ТипДинамическийСписок Тогда
				МассивТаблиц.Добавить( Новый Структура( "Имя, ПутьКДанным", ИмяЭУ, ИмяРеквизита) );
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат МассивТаблиц;
	
КонецФункции	//ПолучитьИменаТаблиц

//	Добавляет на командную панель таблиц формы кнопки для сохранения и восстановления настроек дин. списка, с которым связана данная таблица
// 	Параметры:
// 		пФорма. Тип: "УправляемаяФорма". Открываемая форма.
// 		пМассивСписков. Тип: "Строка" или  "массив" ( тип элемента - "Строка" ). 
// 			Имя элемента управления типа ТаблицаФормы, связанного с динамическим списком, настройками которого нужно управлять. В строке могут быть указаны имена нескольких элементов через запятую: "Список, Контрагенты, СписокСкладскихДокументов"
//       	Необязательный. Если не указан, кнопки сохранения/восстановления будут добавлены на командные панели всех таблиц формы, которые связаны с дин. списками
Процедура ПриСозданииНаСервере( пФорма, пМассивСписков =  Неопределено) Экспорт
	
	Если пМассивСписков = Неопределено Тогда	// массив элементов, настройками которых будем управлять не задан
		// сформируем этот массив самостоятельно. Включим в него имена всех таблиц на форме с источником данных ДинамическийСписок
		МассивИменЭУ = Неопределено;
	ИначеЕсли ТипЗнч(пМассивСписков) = Тип("Строка") Тогда
		МассивИменЭУ = Renault_унсКлиентСервер.СтрокаМассив(СтрЗаменить(пМассивСписков, " ", ""));
	ИначеЕсли ТипЗнч(пМассивСписков) = Тип("Массив") Тогда
		МассивИменЭУ = пМассивСписков;
	КонецЕсли;
	МассивТаблицФормы = ПолучитьМассивТаблицФормы( пФорма, МассивИменЭУ );
	
	// тут будем хранить настройки дин. списков, используемые в форме в данный момент
	// в значении реквизита СписокЗначений, Значение - структура (КлючОбъекта, ИмяРеквизита, НастройкаСсылка, Наименование, ВосстанавливатьПриОткрытии, СохранятьАвтоматически)
	// Эти данные нужны чтобы при закрытии формы сохранить настройки, для которых взведены птицы "Сохранять".
	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов.Добавить( Новый РеквизитФормы( "ОткрытыеНастройкиДинСписков", Новый ОписаниеТипов( "СписокЗначений" ) ) );
	пФорма.ИзменитьРеквизиты( МассивДобавляемыхРеквизитов );
	
	// запоминаем в реквизите формы массив имен элементов управления, которые связаны с дин. списками, и настройками которых будем управлять
	
	// добавляем реквизит формы
	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов.Добавить( Новый РеквизитФормы( "НастройкиДинСписков_МассивЭУ", Новый ОписаниеТипов( "СписокЗначений" ) ) );
	пФорма.ИзменитьРеквизиты( МассивДобавляемыхРеквизитов );
	
	// запоминаем в реквизите НастройкиДинСписков_МассивЭУ список значений. Значение - имя ЭУ, Представление - имя реквизита типа ДинамическийСписок
	сзОбрабатываемыеТаблицыФормы = Новый СписокЗначений;
	Для каждого ТаблицаФормы Из МассивТаблицФормы Цикл
		сзОбрабатываемыеТаблицыФормы.Добавить( ТаблицаФормы.Имя, ТаблицаФормы.ПутьКДанным );
	КонецЦикла;
	пФорма.НастройкиДинСписков_МассивЭУ = сзОбрабатываемыеТаблицыФормы;
	
	// добавляем кнопки на панель
	Для каждого ТаблицаФормы Из МассивТаблицФормы Цикл
		
		ИмяЭлементаУправления = ТаблицаФормы.Имя;
		ИмяРеквизита = ТаблицаФормы.ПутьКДанным;
		КоманднаяПанельТаблицыФормы = пФорма.Элементы.Найти(ИмяЭлементаУправления).КоманднаяПанель;
		
		// если панель списка невидима и на форме только один динамический список, то кнопки сохранения/восстановления настройки добавляем в командную панель формы
		Если ( НЕ КоманднаяПанельТаблицыФормы.Видимость ИЛИ пФорма.Элементы.Найти(ИмяЭлементаУправления).ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет ) И пМассивСписков = Неопределено И МассивТаблицФормы.Количество() = 1 Тогда
			КоманднаяПанельТаблицыФормы = пФорма.КоманднаяПанель;
		КонецЕсли;
		
		// кнопка восстановления настройки
		ИмяКоманды = "ВосстановитьНастройкуДинамическогоСписка_" + ИмяЭлементаУправления + "_" + ИмяРеквизита;
		КомандаКнопки = пФорма.Команды.Добавить(ИмяКоманды);
		КомандаКнопки.Действие = "ВосстановитьНастройкуДинамическогоСписка";
		КомандаКнопки.Картинка = БиблиотекаКартинок.Renault_унсВосстановитьНастройки;
		НоваяКнопка = пФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), КоманднаяПанельТаблицыФормы);
		НоваяКнопка.ИмяКоманды 	= ИмяКоманды;
		НоваяКнопка.Заголовок 	= "Восстановить настройку списка";
		НоваяКнопка.Картинка 	= БиблиотекаКартинок.Renault_унсВосстановитьНастройки;
		
		// кнопка сохранения настройки
		ИмяКоманды = "СохранитьНастройкуДинамическогоСписка_" + ИмяЭлементаУправления + "_" + ИмяРеквизита;
		КомандаКнопки = пФорма.Команды.Добавить(ИмяКоманды);
		КомандаКнопки.Действие = "СохранитьНастройкуДинамическогоСписка";
		КомандаКнопки.Картинка = БиблиотекаКартинок.Renault_унсСохранитьНастройки;
		НоваяКнопка = пФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), КоманднаяПанельТаблицыФормы);
		НоваяКнопка.ИмяКоманды 	= ИмяКоманды;
		НоваяКнопка.Заголовок 	= "Сохранить настройку списка";
		НоваяКнопка.Картинка 	= БиблиотекаКартинок.Renault_унсСохранитьНастройки;
		
	КонецЦикла;
	
КонецПроцедуры
